Tekla Open API Reference for Tekla Structures 2025
CustomLineType.Clone Method
 Creates a new object that is a copy of the current instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override Object Clone()
Public Overrides Function Clone As Object
Return Value
Type: Object
 A new object that is a copy of the current instance.
Implements
ICloneable.Clone()
ICloneable.Clone()
See Also
Reference
CustomLineType Class
Tekla.Structures.Drawing Namespace